"""
Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый
элемент, разность и количество элементов нужно ввести с клавиатуры. Формула
для получения n-го члена прогрессии: an = a1 + (n-1) * d.
Каждое число вводится с новой строки.
"""

el1 = int(input("Введите первый элемент прогрессии: "))
diff = int(input("Введите разность элементов прогрессии: "))
n = int(input("Введите N-ый элемент прогрессии: "))

arr = list()
for i in range(n):
    arr.append(el1 + i * diff)
print(arr)
