# Задача 1. За день машина проезжает n километров. Сколько дней нужно, чтобы проехать маршрут длиной m
# километров? При решении этой задачи нельзя пользоваться условной инструкцией if и циклами.

#import math lib
import math

#input data
speed = int(input("Введите сколько км в день проезжает авто: "))
distance = int(input("Введите расстояние: "))

#output result
print("Кол-во дней в пути:", math.ceil(distance/speed))