# Задача №3. В некоторой школе решили набрать три новых математических класса
# и оборудовать кабинеты для # них новыми партами. За каждой партой может 
# сидеть два учащихся. Известно количество учащихся в # каждом из трех 
# классов. Выведите наименьшее число парт, которое нужно приобрести для них.

# import math lib
import math

# input data
qty_scoolboys1 = int(input("Введите кол-во учеников первого класса: "))
qty_scoolboys2 = int(input("Введите кол-во учеников второго класса: "))
qty_scoolboys3 = int(input("Введите кол-во учеников третьего класса: "))

print("Необходимо парт:", math.ceil(
    (qty_scoolboys1 + qty_scoolboys2 + qty_scoolboys3) / 2))
