# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе
# они сделали S журавликов. Сколько журавликов сделал каждый
# ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов,
# чем Петя и Сережа вместе?

# input data prompt
qty = int(input("Введите количество сделанных журавликов: "))

# solvability check and output result
if qty % 6 == 0:
    print(
        f'Катя сделала {round(qty/6*4)} шт, Петя и Сережа по '
        f'{round(qty/6)} шт')
else:
    print("Количество не соответствует условию задачи (должно быть кратно 6)")
