"""
Задание 3. Создать список и заполнить его элементами различных типов данных.
Реализовать проверку типа данных каждого элемента.
Использовать функцию type() для проверки типа.
Элементы списка можно не запрашивать у пользователя, а указать в программе.
"""

s = ["Виктор", "Артем", 1, None, "манго", 16, "вишня", 3.4, True]

for i in s:
    print(type(i))
