"""
Задание 4.
Реализовать класс Matrix (матрица). Обеспечить перегрузку конструктора класса
(метод init()), который должен принимать данные (список списков) для
формирования матрицы.
Следующий шаг — реализовать перегрузку метода str() для вывода матрицы
в привычном виде.
Далее реализовать перегрузку метода add() для реализации операции сложения
двух объектов класса Matrix (двух матриц). Результатом сложения должна быть
новая матрица.
"""


class Matrix():

    def __init__(self, arr):
        self.mtrx = arr

    def __str__(self):
        for i in self.mtrx:
            print(i)

    def __add__(self, other):
        res_mtrx = [[self.mtrx[i][j] + other[i][j] for j in range
                    (len(self.mtrx[0]))] for i in range(len(self.mtrx))]

        for r in res_mtrx:
            print(r)


m1 = Matrix([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
m1.__str__()
m1.__add__([[9, 8, 7], [6, 5, 4], [3, 2, 1]])
