"""
Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет
на круглой грядке, причем кусты высажены только по окружности. Таким образом,
у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.
Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них
выросло различное число ягод – на i-ом кусте выросло ai  ягод.
В этом фермерском хозяйстве внедрена система автоматического сбора черники.
Эта система состоит из управляющего модуля и нескольких собирающих модулей.
Собирающий модуль за один заход, находясь непосредственно перед некоторым
кустом, собирает ягоды с этого куста и с двух соседних с ним.
Напишите программу для нахождения максимального числа ягод, которое может
собрать за один заход собирающий модуль, находясь перед некоторым кустом
заданной во входном файле грядки.
"""

n = int(input("Введите кол-во кустов на грядке: "))
arr = list(int(x) for x in
           input(
               f"Введите через пробел кол-во ягод на каждом"
               f" из {n} кустов: ").split())

arr_count_berries = list()

for i in range(len(arr) - 1):
    arr_count_berries.append(arr[i] + arr[i - 1] + arr[i + 1])
arr_count_berries.append(arr[0] + arr[-1] + arr[-2])

print(
    f"Максимальное кол-во ягод, которое можно собрать с 3х кустов рядом"
    f" - {max(arr_count_berries)}")
